<?php
//setlocale(LC_ALL, "es_ES.UTF-8");
//$str = "Pérez Ólivá Éspínózá ñátó";
////$str = "Pérez";
//$input = ['á', 'é', 'í', 'ó', 'ú', 'Á', 'É', 'Í', 'Ó', 'Ú', 'ä', 'ë', 'ï', 'ö', 'ü', 'Ä', 'Ë', 'Ï', 'Ö', 'Ü', 'â', 'ã', 'ä', 'å', 'ā', 'ă', 'ą', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Ā', 'Ă', 'Ą', 'è', 'é', 'é', 'ê', 'ë', 'ē', 'ĕ', 'ė', 'ę', 'ě', 'Ē', 'Ĕ', 'Ė', 'Ę', 'Ě', 'ì', 'í', 'î', 'ï', 'ì', 'ĩ', 'ī', 'ĭ', 'Ì', 'Í', 'Î', 'Ï', 'Ì', 'Ĩ', 'Ī', 'Ĭ', 'ó', 'ô', 'õ', 'ö', 'ō', 'ŏ', 'ő', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ō', 'Ŏ', 'Ő', 'ù', 'ú', 'û', 'ü', 'ũ', 'ū', 'ŭ', 'ů', 'Ù', 'Ú', 'Û', 'Ü', 'Ũ', 'Ū', 'Ŭ', 'Ů', 'Ñ', 'ñ'];
//$output = '_';
//$str = str_replace(' ', '', $str);
//$str = str_replace($input, $output, $str);
////$newstring = mb_convert_encoding($str, 'ISO-8859-15', 'UTF-8');
////$str = iconv("UTF-8","ascii//TRANSLIT", $str);
//echo $str . '<br>';
////echo $newstring;
//log_message('error', "str: $str, new: ");
// => Perez
phpinfo();
